src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/РаботаСКурсамиВалютПлатформа/Ext/Module.bsl
// Общий модуль "Префиксация объектов (платформа)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает курс валюты на дату.
//
// Параметры:
//   Валюта        - СправочникСсылка.Валюты      - Валюта, для которой получается курс.
//   МоментВремени - Дата, МоментВремени, Граница - Дата, на которую получается курс.
//
// Возвращаемое значение:
//   Число - значение курса валюты.
//
Функция ПолучитьКурсВалюты(Валюта, МоментВремени, ВыводитьПредупреждение=ИСТИНА) Экспорт
	
	// Если валюта не заполнена, то делать запрос к регистру не имеет смысла
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Уточним дату,на которую требуется получить значение курса
	Если МоментВремени=Неопределено Тогда
		МоментВремени = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Получим данные из регистра
	КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(МоментВремени, Новый Структура("Валюта", Валюта));
	
	// Проверим был ли задан курс на указанную дату
	Если КурсВалюты.Курс=0 Тогда
		
		// Предупредим пользователя о не состоятельности последующих расчетов
		Если ВыводитьПредупреждение Тогда
			НаДату = ?(ТипЗнч(МоментВремени)=Тип("Граница"), МоментВремени.Значение, МоментВремени);
			НаДату = ?(ТипЗнч(НаДату)=Тип("МоментВремени"),  НаДату.Дата,            НаДату);
			ВывестиСообщение(НСтр("ru = 'Курс валюты ""%1"" на дату %2 не задан.'"), Валюта, Формат(НаДату, "ДЛФ=DD"));
		КонецЕсли;
		
		Возврат 0;
		
	КонецЕсли;
	
	// Вычисляем математическое значение курса
	Возврат ?(КурсВалюты.Кратность=0 ИЛИ КурсВалюты.Кратность=1, КурсВалюты.Курс, КурсВалюты.Курс / КурсВалюты.Кратность);
	
КонецФункции // ПолучитьКурсВалюты()

// Возвращает значение курса валюты взаиморасчетов для документа
// Параметры:
// ЭтотОбъект	-	ДокументСсылка или ДокументОбъект		- документ для которого рассчитывается курс
// Договор		-	СправочникСсылка.ДоговорыВзаиморасчетов	- договор взаиморасчетов
// Основание	-	ДокументСсылка							- документ основание.
//
// Возвращаемое значение:
// Число - значение курса валюты взаимозачетов.
//
Функция ПолучитьКурсВалютыВзаиморасчетов(Объект, Знач Договор = Неопределено, Основание = Неопределено) Экспорт
	
	Курс = 0;
	ДатаДокумента = Объект.Дата;
	
	// в документах договор взаиморасчетов может называться по-разному
	МассивДопустимыеИменаДоговорВзаиморасчетов = Новый Массив;
	МассивДопустимыеИменаДоговорВзаиморасчетов.Добавить("ДоговорВзаиморасчетов");
	МассивДопустимыеИменаДоговорВзаиморасчетов.Добавить("ДоговорВзаиморасчетовИнкассатор");
	
	ЭтотОбъектДоговорИмя = "";
	ОснованиеДоговорИмя  = "";
	Для Индекс = 0 По МассивДопустимыеИменаДоговорВзаиморасчетов.ВГраница() Цикл
		
		ИмяДоговораВзаиморасчетов = МассивДопустимыеИменаДоговорВзаиморасчетов[Индекс];
		
		Если ПустаяСтрока(ЭтотОбъектДоговорИмя) И ЕстьРеквизит(Объект, ИмяДоговораВзаиморасчетов) Тогда
			
			ЭтотОбъектДоговорИмя = ИмяДоговораВзаиморасчетов;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Основание) И ПустаяСтрока(ОснованиеДоговорИмя) И ЕстьРеквизит(Основание, ИмяДоговораВзаиморасчетов) Тогда
			
			ОснованиеДоговорИмя = ИмяДоговораВзаиморасчетов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Если не передан Договор, значит в документе или в документе основании реквизит договора
	// назван "не стандартно", попробуем получить договор сами.
	Если НЕ ЗначениеЗаполнено(Договор) И (НЕ ПустаяСтрока(ЭтотОбъектДоговорИмя)) Тогда
		
		Договор = Объект[ЭтотОбъектДоговорИмя];
		
		// считаем, что происходит ввод на основании, берем договор из основания
		Если (НЕ ЗначениеЗаполнено(Договор)) И ЗначениеЗаполнено(Основание) И (НЕ ПустаяСтрока(ОснованиеДоговорИмя)) Тогда
			Договор = Основание[ОснованиеДоговорИмя];
		КонецЕсли;
		
	КонецЕсли;
	
	// без договора взаиморасчетов курс не получить
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Возврат 0;
	КонецЕсли;
	
	спрВалютаДоговора = Договор.ВалютаВзаиморасчетов;
	
	Если ЗначениеЗаполнено(Основание) И (Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание.Ссылка))) И (НЕ (ПустаяСтрока(ЭтотОбъектДоговорИмя) ИЛИ ПустаяСтрока(ОснованиеДоговорИмя))) И (Основание[ОснованиеДоговорИмя] = Договор) Тогда
		
		// Если определен документ основание и договор основания совпадает с договором документа.
		спрВалютаОснования = Основание.ВалютаДокумента;
		спрВалютаДоговораОснования = Основание[ОснованиеДоговорИмя].ВалютаВзаиморасчетов;
		Если спрВалютаОснования = спрВалютаДоговораОснования Тогда
			// Если валюта документа основания совпадает с его валютой расчетов,
			// попытаемся получить курс валюты расчетов из реквизита документа КурсВалютыВзаиморасчетов,
			// реквизита может не быть у документа.
			Попытка
				Курс = Основание.КурсВалютыВзаиморасчетов;
			Исключение
				Курс = 0;
			КонецПопытки;
			
			// Если курс все еще равен нулю, значит попытка получить его была неудачная,
			// возьмем курс валюты взаиморасчетов на дату основания.
			Если Курс = 0 Тогда
				Курс = ПолучитьКурсВалюты(Договор.ВалютаВзаиморасчетов, Основание.Дата);
			КонецЕсли;
		Иначе
			// если валюты не совпадают, берем курс валюты взаиморасчетов на дату основания
			Курс = ПолучитьКурсВалюты(спрВалютаДоговора, Основание.Дата);
		КонецЕсли;
	Иначе
		// если основание не определено или договоры документа и основания не совпадают
		Курс = ПолучитьКурсВалюты(спрВалютаДоговора, ДатаДокумента);
	КонецЕсли;
	
	Возврат Курс;
	
КонецФункции // ПолучитьКурсВалютыВзаиморасчетов()

// Получает коэффициент пересчета из валюты упр. учета в валюту регл.учета на заданную дату.
//
// Параметры:
//  Дата - Дата - на какую дату получить.
//
Функция ПолучитьКоэффициентПересчетаВалют(Дата) Экспорт
	
	КурсРегл = ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(), Дата);
	КурсУпр  = ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(),        Дата);
	
	Возврат ?(КурсРегл=0, 0, КурсУпр / КурсРегл);
	
КонецФункции // плПолучитьКоэффициентПересчетаВалют()

// функция получения валюты учета
//
// Параметры:
//	Номенклатура	- СправочникСсылка	- Номенклатура
//	ТипЦен			- СправочникСсылка	- Тип цен.
//
// Возвращаемое значение:
//	СправочникСсылка	- валюта цены.
//
Функция ВалютаТипаЦены(ТипЦен, Номенклатура=Неопределено, ВыводитьСообщения=ЛОЖЬ) Экспорт
	
	Если Номенклатура <> Неопределено И ТипЦен.ВВалютеУчета Тогда
		Если НЕ ЗначениеЗаполнено(Номенклатура.ВалютаУчета) Тогда
			Если ВыводитьСообщения Тогда
				ВывестиСообщение(НСтр("ru = 'Не заполнена валюта учета номенклатуры ""%1"". Используется валюта регламентированного учета.'"),,,,, Номенклатура);
			КонецЕсли;
			Результат = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Иначе
			Результат = Номенклатура.ВалютаУчета;
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(ТипЦен.ВалютаЦены) Тогда
			Если ВыводитьСообщения Тогда
				ВывестиСообщение(НСтр("ru = 'Не заполнена валюта типа цен ""%1"". Используется валюта регламентированного учета.'"),,,,, ТипЦен);
			КонецЕсли;
			Результат = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Иначе
			Результат = ТипЦен.ВалютаЦены;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ВалютаТипаЦены(Номенклатура, ТипЦен)Экспорт

// функция пересчитывает Цену из одного курса валюты в другой.
//
// Параметры:
//	Сумма           - Число - Сумма для пересчета
//	КурсНачальный   - Число - Курс валюты или дата курса
//	КурсКонечный    - Число - Курс валюты или дата курса
//	РежимОкругления - Число - Режим округления.
//
// Возвращаемое значение:
//	Число - Сумма после пересчета
//
Функция ПересчетПоКурсу(Знач Сумма, КурсНачальный, КурсКонечный, Знач РежимОкругления = Неопределено) Экспорт
	
	Если (КурсНачальный*КурсКонечный)=0 Тогда
		ВывестиСообщение(НСтр("ru = 'При пересчете валюты обнаружен нулевой курс.'"));
		Возврат Сумма;
	КонецЕсли;
	
	Если КурсНачальный = КурсКонечный Тогда
		Возврат Сумма;
	КонецЕсли;
	
	ЧислоРезультат = Сумма*КурсНачальный/КурсКонечный;
	
	Если НЕ РежимОкругления = Неопределено Тогда
		ЧислоРезультат = Окр(ЧислоРезультат, 2, РежимОкругления);
	КонецЕсли;
	
	Возврат ЧислоРезультат;
	
КонецФункции // ПересчетПоКурсу()

// Функция пересчитывает Цену из одной валюты в другую.
// в параметрах КурсНачальный и КурсКонечный могут передаваться либо сами курсы либо даты.
//
// Параметры:
//	Сумма           - Число            - Сумма для пересчета
//	ВалютаНачальная - СправочникСсылка - Начальная валюта
//	КурсНачальный   - Число, Дата      - Курс валюты или дата курса
//	ВалютаКонечная  - СправочникСсылка - Конечная валюта
//	КурсКонечный    - Число, Дата      - Курс валюты или дата курса
//	РежимОкругления - Число            - Режим округления.
//
// Возвращаемое значение:
//	Число - Сумма после пересчета
//
Функция ПересчетПоВалюте(Знач Сумма, ВалютаНачальная, КурсНачальный, ВалютаКонечная, КурсКонечный, Знач РежимОкругления = Неопределено) Экспорт
	
	Если Сумма = NULL Тогда
		Возврат 0;
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(ВалютаНачальная)) ИЛИ (НЕ ЗначениеЗаполнено(ВалютаКонечная)) Тогда
		Возврат Сумма;
	КонецЕсли;
	
	Если ВалютаНачальная = ВалютаКонечная Тогда
		Возврат Сумма;
	КонецЕсли;
	
	ТипКурса = ТипЗнч(КурсНачальный);
	
	Если ТипКурса = Тип("Число") Тогда
		КурсВалютыНач = КурсНачальный;
		
	ИначеЕсли (ТипКурса = Тип("Дата")) ИЛИ (ТипКурса = Тип("МоментВремени")) ИЛИ (ТипКурса = Тип("Граница")) Тогда
		КурсВалютыНач = ПолучитьКурсВалюты(ВалютаНачальная, КурсНачальный);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Неверный тип параметра при пересчете валюты.(1)'"));
		Возврат Сумма;
	КонецЕсли;
	
	ТипКурса = ТипЗнч(КурсКонечный);
	
	Если ТипКурса = Тип("Число") Тогда
		КурсВалютыКон = КурсКонечный;
		
	ИначеЕсли (ТипКурса = Тип("Дата")) ИЛИ (ТипКурса = Тип("МоментВремени")) ИЛИ (ТипКурса = Тип("Граница")) Тогда 
		КурсВалютыКон = ПолучитьКурсВалюты(ВалютаКонечная, КурсКонечный);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Неверный тип параметра при пересчете валюты.(2)'"));
		Возврат Сумма;
	КонецЕсли;
	
	Результат = ПересчетПоКурсу(Сумма, КурсВалютыНач, КурсВалютыКон, РежимОкругления);
	
	Возврат Результат;
	
КонецФункции // ПересчетПоВалюте
